# ------------------------------
# Базовый образ Python
# ------------------------------
FROM python:3.12-slim

# ------------------------------
# Отключаем запись pyc и буферизацию stdout/stderr
# ------------------------------
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# ------------------------------
# Рабочая директория внутри контейнера
# ------------------------------
WORKDIR /app

# ------------------------------
# Копируем зависимости и устанавливаем их
# ------------------------------
COPY requirements.txt .
RUN pip install --upgrade pip
RUN pip install --no-cache-dir -r requirements.txt

# ------------------------------
# Копируем весь проект в контейнер
# ------------------------------
COPY . .

# ------------------------------
# Собираем статику сразу для продакшена
# Whitenoise будет отдавать файлы из STATIC_ROOT
# ------------------------------
RUN python manage.py collectstatic --noinput

# ------------------------------
# Экспонируем порт Gunicorn
# ------------------------------
EXPOSE 8000

# ------------------------------
# Команда запуска Gunicorn
# 3 воркера, логи выводятся в консоль
# ------------------------------
CMD ["gunicorn", "mgrupsite.wsgi:application", "--bind", "0.0.0.0:8000", "--workers", "3", "--access-logfile", "-", "--error-logfile", "-"]

